local str_back = [[本模组源自经典模组【热带体验(tropical experience)】。
保留了原模组的海难和哈姆雷特部分，并在此基础上进行了大量优化和补充。
目前本模组【兼容性较好】，但是作为创意工坊内体量最大的MOD之一，与某些大型模组的兼容性存在一些问题。
尤其【不建议】与其他【包含单机DLC内容的模组】，或者在单机DLC内容上进行修改的模组一并开启。
-----------------------------------------
由于模组体量庞大，百科全书中优先收录本模组原创与优化的内容。
]]


local str_progress = [[
26.02.23 更新：
    1. 添加Mod百科


=========================================
]]




local str_preview = [[
本模组全称为【热带冒险 | 忒修斯之船】。
正如其名，我希望在保持模组始终可用的前提下，像忒修斯之船一样，逐步替换、更新原有的内容，让它不断焕发新生。

如果您觉得已有的旅程还算精彩，欢迎通过打赏支持我们。您的赞赏是对过去工作的肯定，也是支撑我们继续的动力。
]]

local WikiAbout = {
    str_back = str_back,
    str_progress = str_progress,
    str_preview = str_preview,
}

return {
    WikiAbout = WikiAbout,
}
